In [1]:
str1 = 'as'
int1 = 9 
print(len(str1))
print(abs(int1))

2
9

In [2]:
def my_abs(x):
    if x < 0:
        x = -x
    return x

print(my_abs(-9))

9

In [3]:
def myadd(x, y ,f ):
    return f(x) + f(y)

print(myadd( -9 , 2, my_abs))

11

In [4]:
mylist = [-1, 2, -7, 3, 4,5]
map(abs, mylist)
for i in map(abs, mylist):
    print(i)

1
2
7
3
4
5

In [5]:
f = lambda x: x**2
f(2)

4

In [6]:
for i in map( lambda x:x**2, mylist):
    print(i)

1
4
49
9
16
25

In [7]:
import pandas as pd

df = pd.DataFrame({'key':['a', 'b', 'c', 'd'], 'value1':range(1,5) })
df.head()

  key  value1
0   a       1
1   b       2
2   c       3
3   d       4

In [8]:
one = pd.read_csv('./one.csv')
one

   x  a
0  1  a
1  1  a
2  1  b
3  2  c
4  3  v
5  4  e
6  6  g

In [10]:
import os
os.chdir('./')
hsb=pd.read_table('hsb2.txt')
hsb

      id  female  race  ses  schtyp  prog  read  write  math  science  socst
0     70       0     4    1       1     1    57     52    41       47     57
1    121       1     4    2       1     3    68     59    53       63     61
2     86       0     4    3       1     1    44     33    54       58     31
3    141       0     4    3       1     3    63     44    47       53     56
4    172       0     4    2       1     2    47     52    57       53     61
..   ...     ...   ...  ...     ...   ...   ...    ...   ...      ...    ...
195   31       1     2    2       2     1    55     59    52       42     56
196  145       1     4    2       1     3    42     46    38       36     46
197  187       1     4    2       2     1    57     41    57       55     52
198  118       1     4    2       1     1    55     62    58       58     61
199  137       1     4    3       1     2    63     65    65       53     61

[200 rows x 11 columns]